# part 1

In [ ]:
# pip install pandas

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
label = ['a', 'b', 'c', 'd']
my_arr = np.array([10, 20, 30, 40])
my_li = [10, 20, 30, 40]

d = {10:'a', '20':20, 'c':30, 40:'d'}

In [ ]:
pd.Series(label)

0    a
1    b
2    c
3    d
dtype: object

In [ ]:
pd.Series(data = label, index = my_arr)

10    a
20    b
30    c
40    d
dtype: object

In [ ]:
pd.Series(data = d)

10     a
20    20
c     30
40     d
dtype: object

In [ ]:
pd.Series(my_li).astype('int32')

0    10
1    20
2    30
3    40
dtype: int32

In [ ]:
pd.Series(my_li).astype('float32')

0    10.0
1    20.0
2    30.0
3    40.0
dtype: float32

In [ ]:
ser1 = pd.Series(data = [1, 2, 3, 4], index = ['USA', 'Japan', 'India', 'Italy'])
ser1

USA      1
Japan    2
India    3
Italy    4
dtype: int64

In [ ]:
ser2 = pd.Series(data = [1, 2, 5, 4], index = ['USA', 'Japan', 'Germany', 'Italy'])
ser2

USA        1
Japan      2
Germany    5
Italy      4
dtype: int64

In [ ]:
ser1 + ser2

Germany    NaN
India      NaN
Italy      8.0
Japan      4.0
USA        2.0
dtype: float64

In [ ]:
np.random.seed(100)

In [ ]:
df = pd.DataFrame(np.random.randn(5, 4), index = ['A', 'B', 'C', 'D', 'E'], columns = ['W', 'X', 'Y', 'Z'])

In [ ]:
df

          W         X         Y         Z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411
E -0.531280  1.029733 -0.438136 -1.118318

In [ ]:
df['Y']

A    1.153036
B    0.221180
C   -0.458027
D    0.672721
E   -0.438136
Name: Y, dtype: float64

In [ ]:
type(df['Y'])

pandas.core.series.Series

In [ ]:
df[['Y']]

          Y
A  1.153036
B  0.221180
C -0.458027
D  0.672721
E -0.438136

In [ ]:
df[['Y', 'W']]

          Y         W
A  1.153036 -1.749765
B  0.221180  0.981321
C -0.458027 -0.189496
D  0.672721 -0.583595
E -0.438136 -0.531280

In [ ]:
df.Y

A    1.153036
B    0.221180
C   -0.458027
D    0.672721
E   -0.438136
Name: Y, dtype: float64

In [ ]:
df

          W         X         Y         Z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411
E -0.531280  1.029733 -0.438136 -1.118318

In [ ]:
df['new'] = df['Y'] + df['Z']

In [ ]:
df

          W         X         Y         Z       new
A -1.749765  0.342680  1.153036 -0.252436  0.900600
B  0.981321  0.514219  0.221180 -1.070043 -0.848864
C -0.189496  0.255001 -0.458027  0.435163 -0.022863
D -0.583595  0.816847  0.672721 -0.104411  0.568310
E -0.531280  1.029733 -0.438136 -1.118318 -1.556454

In [ ]:
df['new2'] = [1, 2, 3, 4, 5]

In [ ]:
df

          W         X         Y         Z       new  new2
A -1.749765  0.342680  1.153036 -0.252436  0.900600     1
B  0.981321  0.514219  0.221180 -1.070043 -0.848864     2
C -0.189496  0.255001 -0.458027  0.435163 -0.022863     3
D -0.583595  0.816847  0.672721 -0.104411  0.568310     4
E -0.531280  1.029733 -0.438136 -1.118318 -1.556454     5

In [ ]:
df['new3'] = {10:'a', 20:'b', 30:'c', 40:'d', 50:'e'}

In [ ]:
df

          W         X         Y         Z       new  new2  new3
A -1.749765  0.342680  1.153036 -0.252436  0.900600     1    10
B  0.981321  0.514219  0.221180 -1.070043 -0.848864     2    20
C -0.189496  0.255001 -0.458027  0.435163 -0.022863     3    30
D -0.583595  0.816847  0.672721 -0.104411  0.568310     4    40
E -0.531280  1.029733 -0.438136 -1.118318 -1.556454     5    50

In [ ]:
df.drop('new2', axis = 1)

          W         X         Y         Z       new  new3
A -1.749765  0.342680  1.153036 -0.252436  0.900600    10
B  0.981321  0.514219  0.221180 -1.070043 -0.848864    20
C -0.189496  0.255001 -0.458027  0.435163 -0.022863    30
D -0.583595  0.816847  0.672721 -0.104411  0.568310    40
E -0.531280  1.029733 -0.438136 -1.118318 -1.556454    50

In [ ]:
df

          W         X         Y         Z       new  new2  new3
A -1.749765  0.342680  1.153036 -0.252436  0.900600     1    10
B  0.981321  0.514219  0.221180 -1.070043 -0.848864     2    20
C -0.189496  0.255001 -0.458027  0.435163 -0.022863     3    30
D -0.583595  0.816847  0.672721 -0.104411  0.568310     4    40
E -0.531280  1.029733 -0.438136 -1.118318 -1.556454     5    50

In [ ]:
df.drop('new2', axis = 1, inplace = True)

In [ ]:
df

          W         X         Y         Z       new  new3
A -1.749765  0.342680  1.153036 -0.252436  0.900600    10
B  0.981321  0.514219  0.221180 -1.070043 -0.848864    20
C -0.189496  0.255001 -0.458027  0.435163 -0.022863    30
D -0.583595  0.816847  0.672721 -0.104411  0.568310    40
E -0.531280  1.029733 -0.438136 -1.118318 -1.556454    50

In [ ]:
del df['new3']

In [ ]:
df

          W         X         Y         Z       new
A -1.749765  0.342680  1.153036 -0.252436  0.900600
B  0.981321  0.514219  0.221180 -1.070043 -0.848864
C -0.189496  0.255001 -0.458027  0.435163 -0.022863
D -0.583595  0.816847  0.672721 -0.104411  0.568310
E -0.531280  1.029733 -0.438136 -1.118318 -1.556454

In [ ]:
df['W']

A   -1.749765
B    0.981321
C   -0.189496
D   -0.583595
E   -0.531280
Name: W, dtype: float64

In [ ]:
df.loc[['D']]

          W         X         Y         Z      new
D -0.583595  0.816847  0.672721 -0.104411  0.56831

In [ ]:
df.loc['F'] = [21,31, 41, 51, 61]

In [ ]:
df

           W          X          Y          Z        new
A  -1.749765   0.342680   1.153036  -0.252436   0.900600
B   0.981321   0.514219   0.221180  -1.070043  -0.848864
C  -0.189496   0.255001  -0.458027   0.435163  -0.022863
D  -0.583595   0.816847   0.672721  -0.104411   0.568310
E  -0.531280   1.029733  -0.438136  -1.118318  -1.556454
F  21.000000  31.000000  41.000000  51.000000  61.000000

In [ ]:
df.drop('F', axis = 0)

          W         X         Y         Z       new
A -1.749765  0.342680  1.153036 -0.252436  0.900600
B  0.981321  0.514219  0.221180 -1.070043 -0.848864
C -0.189496  0.255001 -0.458027  0.435163 -0.022863
D -0.583595  0.816847  0.672721 -0.104411  0.568310
E -0.531280  1.029733 -0.438136 -1.118318 -1.556454

In [ ]:
df.drop('F', axis = 1)

KeyError: "['F'] not found in axis"

In [ ]:
df

           W          X          Y          Z        new
A  -1.749765   0.342680   1.153036  -0.252436   0.900600
B   0.981321   0.514219   0.221180  -1.070043  -0.848864
C  -0.189496   0.255001  -0.458027   0.435163  -0.022863
D  -0.583595   0.816847   0.672721  -0.104411   0.568310
E  -0.531280   1.029733  -0.438136  -1.118318  -1.556454
F  21.000000  31.000000  41.000000  51.000000  61.000000

In [ ]:
df['Y']['D']

0.672720805709661

In [ ]:
df.loc['D']['Y']

0.672720805709661

In [ ]:
df.loc['D', 'Y']

0.672720805709661

In [ ]:
df.loc[['D', 'E', 'F'], ['Y', 'Z']]

           Y          Z
D   0.672721  -0.104411
E  -0.438136  -1.118318
F  41.000000  51.000000

In [ ]:
df.iloc[4]

W     -0.531280
X      1.029733
Y     -0.438136
Z     -1.118318
new   -1.556454
Name: E, dtype: float64

In [ ]:
df.iloc[4][3]

-1.1183182462554362

In [ ]:
df.iloc[3:, 2:4]

           Y          Z
D   0.672721  -0.104411
E  -0.438136  -1.118318
F  41.000000  51.000000

# Part 2

In [ ]:
df

           W          X          Y          Z        new
A  -1.749765   0.342680   1.153036  -0.252436   0.900600
B   0.981321   0.514219   0.221180  -1.070043  -0.848864
C  -0.189496   0.255001  -0.458027   0.435163  -0.022863
D  -0.583595   0.816847   0.672721  -0.104411   0.568310
E  -0.531280   1.029733  -0.438136  -1.118318  -1.556454
F  21.000000  31.000000  41.000000  51.000000  61.000000

In [ ]:
df['Y'] >= 0

A     True
B     True
C    False
D     True
E    False
F     True
Name: Y, dtype: bool

In [ ]:
mask = df['Y'] >= 0

In [ ]:
df[mask]

           W          X          Y          Z        new
A  -1.749765   0.342680   1.153036  -0.252436   0.900600
B   0.981321   0.514219   0.221180  -1.070043  -0.848864
D  -0.583595   0.816847   0.672721  -0.104411   0.568310
F  21.000000  31.000000  41.000000  51.000000  61.000000

In [ ]:
df[df['Y'] >= 0]

           W          X          Y          Z        new
A  -1.749765   0.342680   1.153036  -0.252436   0.900600
B   0.981321   0.514219   0.221180  -1.070043  -0.848864
D  -0.583595   0.816847   0.672721  -0.104411   0.568310
F  21.000000  31.000000  41.000000  51.000000  61.000000

In [ ]:
df['Z'] < 0

A     True
B     True
C    False
D     True
E     True
F    False
Name: Z, dtype: bool

In [ ]:
df[(df['Y'] >= 0) and (df['Z'] < 0)]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [ ]:
df[(df['Y'] >= 0) & (df['Z'] < 0)]

          W         X         Y         Z       new
A -1.749765  0.342680  1.153036 -0.252436  0.900600
B  0.981321  0.514219  0.221180 -1.070043 -0.848864
D -0.583595  0.816847  0.672721 -0.104411  0.568310

In [ ]:
df[(df['Y'] >= 0) | (df['Z'] < 0)]

           W          X          Y          Z        new
A  -1.749765   0.342680   1.153036  -0.252436   0.900600
B   0.981321   0.514219   0.221180  -1.070043  -0.848864
D  -0.583595   0.816847   0.672721  -0.104411   0.568310
E  -0.531280   1.029733  -0.438136  -1.118318  -1.556454
F  21.000000  31.000000  41.000000  51.000000  61.000000

In [ ]:
df[(df['Y'] >= 0) & (df['Z'] < 0)][['W', 'X']]

          W         X
A -1.749765  0.342680
B  0.981321  0.514219
D -0.583595  0.816847

In [ ]:
data = {'Company': ['Google', 'Google', 'MSFT', 'MSFT', 'FB', 'FB'],
        'Person' : ['Tony', 'Bruice', 'Vision', 'Wanda', 'Steve', 'Joker'],
        'Sales'  : [600, 540, 580, 500, 600, 540]}

In [ ]:
df = pd.DataFrame(data)

In [ ]:
df

  Company  Person  Sales
0  Google    Tony    600
1  Google  Bruice    540
2    MSFT  Vision    580
3    MSFT   Wanda    500
4      FB   Steve    600
5      FB   Joker    540

In [ ]:
df_bycomp = df.groupby('Company')

In [ ]:
df_bycomp.mean()

         Sales
Company
FB         570
Google     570
MSFT       540

In [ ]:
df_bycomp.sum()

         Sales
Company
FB        1140
Google    1140
MSFT      1080

In [ ]:
df_bycomp.min()

         Person  Sales
Company
FB        Joker    540
Google   Bruice    540
MSFT     Vision    500

In [ ]:
df

  Company  Person  Sales
0  Google    Tony    600
1  Google  Bruice    540
2    MSFT  Vision    580
3    MSFT   Wanda    500
4      FB   Steve    600
5      FB   Joker    540

In [ ]:
df_bycomp.count()

         Person  Sales
Company
FB            2      2
Google        2      2
MSFT          2      2

In [ ]:
df_bycomp.describe()

        Sales
        count   mean        std    min    25%    50%    75%    max
Company
FB        2.0  570.0  42.426407  540.0  555.0  570.0  585.0  600.0
Google    2.0  570.0  42.426407  540.0  555.0  570.0  585.0  600.0
MSFT      2.0  540.0  56.568542  500.0  520.0  540.0  560.0  580.0

In [ ]:
df_bycomp.describe().T

Company              FB      Google        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   570.000000  570.000000  540.000000
      std     42.426407   42.426407   56.568542
      min    540.000000  540.000000  500.000000
      25%    555.000000  555.000000  520.000000
      50%    570.000000  570.000000  540.000000
      75%    585.000000  585.000000  560.000000
      max    600.000000  600.000000  580.000000

In [ ]:
df_bycomp.describe().loc['Google']

Sales  count      2.000000
       mean     570.000000
       std       42.426407
       min      540.000000
       25%      555.000000
       50%      570.000000
       75%      585.000000
       max      600.000000
Name: Google, dtype: float64

In [ ]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3']},
                  index = [0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7']},
                  index = [4, 5, 6, 7])

In [ ]:
df1

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3

In [ ]:
df2

    A   B   C
4  A4  B4  C4
5  A5  B5  C5
6  A6  B6  C6
7  A7  B7  C7

In [ ]:
pd.concat([df1, df2])

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
4  A4  B4  C4
5  A5  B5  C5
6  A6  B6  C6
7  A7  B7  C7

In [ ]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3']},
                  index = [0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'D': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7']},
                  index = [4, 5, 6, 7])

In [ ]:
df1

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3

In [ ]:

df2

    A   D   C
4  A4  B4  C4
5  A5  B5  C5
6  A6  B6  C6
7  A7  B7  C7

In [ ]:
pd.concat([df1, df2])

    A    B   C    D
0  A0   B0  C0  NaN
1  A1   B1  C1  NaN
2  A2   B2  C2  NaN
3  A3   B3  C3  NaN
4  A4  NaN  C4   B4
5  A5  NaN  C5   B5
6  A6  NaN  C6   B6
7  A7  NaN  C7   B7

In [ ]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3']},
                  index = [0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7']},
                  index = [4, 5, 2, 7])

In [ ]:
pd.concat([df1, df2], axis = 1)

     A    B    C    A    B    C
0   A0   B0   C0  NaN  NaN  NaN
1   A1   B1   C1  NaN  NaN  NaN
2   A2   B2   C2   A6   B6   C6
3   A3   B3   C3  NaN  NaN  NaN
4  NaN  NaN  NaN   A4   B4   C4
5  NaN  NaN  NaN   A5   B5   C5
7  NaN  NaN  NaN   A7   B7   C7

In [ ]:
pd.concat([df1, df2])

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
4  A4  B4  C4
5  A5  B5  C5
2  A6  B6  C6
7  A7  B7  C7

In [ ]:
left = pd.DataFrame({'key':['K0', 'K1', 'K2', 'K3'],
                     'A'  :['A0', 'A1', 'A2', 'A3'],
                     'B'  :['B0', 'B1', 'B2', 'B3']})

right = pd.DataFrame({'key':['K0', 'K1', 'K4', 'K3'],
                     'C'  :['C0', 'C1', 'C2', 'C3'],
                     'D'  :['D0', 'D1', 'D2', 'D3']})

In [ ]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [ ]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K4  C2  D2
3  K3  C3  D3

In [ ]:
pd.merge(left, right, on = 'key', how = 'inner')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K3  A3  B3  C3  D3

In [ ]:
pd.merge(left, right, on = 'key', how = 'left')

  key   A   B    C    D
0  K0  A0  B0   C0   D0
1  K1  A1  B1   C1   D1
2  K2  A2  B2  NaN  NaN
3  K3  A3  B3   C3   D3

In [ ]:
pd.merge(left, right, on = 'key', how = 'right')

  key    A    B   C   D
0  K0   A0   B0  C0  D0
1  K1   A1   B1  C1  D1
2  K4  NaN  NaN  C2  D2
3  K3   A3   B3  C3  D3

In [ ]:
left = pd.DataFrame({'A'  :['A0', 'A1', 'A2', 'A3'],
                     'B'  :['B0', 'B1', 'B2', 'B3']},
                   index = ['K0', 'K1', 'K2', 'K3'])

right = pd.DataFrame({'C'  :['C0', 'C1', 'C2', 'C3'],
                     'D'  :['D0', 'D1', 'D2', 'D3']},
                    index = ['K0', 'K1', 'K4', 'K3'])

In [ ]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2
K3  A3  B3

In [ ]:

right

     C   D
K0  C0  D0
K1  C1  D1
K4  C2  D2
K3  C3  D3

In [ ]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1   C1   D1
K2  A2  B2  NaN  NaN
K3  A3  B3   C3   D3

In [ ]:
left.join(right, how = 'inner')

     A   B   C   D
K0  A0  B0  C0  D0
K1  A1  B1  C1  D1
K3  A3  B3  C3  D3

In [ ]:
left.join(right, how = 'outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1   C1   D1
K2   A2   B2  NaN  NaN
K3   A3   B3   C3   D3
K4  NaN  NaN   C2   D2